{
  "location": "New Taipei City, Taiwan (R.O.C.).",
  "langLabel": "Change Language",
  "themeLabel": "Change Theme",
  "catchd-1-tit": "Provided UI/UX design suggestions",
  "catchd-1-content": "Proactively proposed improvement plans to optimize the user interface and experience, enhancing user satisfaction and interaction rates.",
  "catchd-2-tit": "Developed a mini-game event website",
  "catchd-2-content": "Responsible for the entire development process, focusing not only on the interactivity of the game itself but also on optimizing the gaming scenario for a better experience.",
  "catchd-3-tit": "Built a brand image official website",
  "catchd-3-content": "Worked closely with designers to ensure visual style consistency and collaborated with the backend team to develop API interfaces.",
  "catchd-4-tit": "Created Landing Pages",
  "catchd-4-content": "Utilized creative design and technology to produce Landing Pages that met client expectations.",
  "catchd-5-tit": "Maintained and optimized the Vue.js official website",
  "catchd-5-content": "Took over and improved existing Vue.js projects, making customized modifications according to client needs, which enhanced page performance and user experience.",
  "freelancer-1-tit": "Leading Projects from a Brand Perspective",
  "freelancer-1-content": "Actively participating in decision-making processes as a business perspective, deepening understanding of commercial strategies and management thinking, effectively bridging technical implementation and business goals.",
  "freelancer-2-tit": "Customer Communication and Design Participation",
  "freelancer-2-content": "Going beyond traditional engineering roles by actively engaging in early design and concept phases, ensuring high alignment between technological realization and customer needs.",
  "freelancer-3-tit": "Nonprofit Organization Website Development",
  "freelancer-3-content": "Leading teams through full-cycle nonprofit organization website building, including design, space rental, and development, boosting organizational impact.",
  "freelancer-4-tit": "Automotive Brand Online Preorder Website",
  "freelancer-4-content": "Independently responsible for layout and API integration, realizing smooth user shopping experiences, promoting sales growth.",
  "freelancer-5-tit": "Household Product Brand Comic Book Game Website",
  "freelancer-5-content": "Utilizing CSS3 to implement comic book flippage effects, developing JS mini-games (drag & sort, maze etc.), enriching user interactions, increasing user stay time.",
  "freelancer-6-tit": "Bank Event Landing Page",
  "freelancer-6-content": "Contributing to multiple bank event landing pages' creation, achieving enhanced conversion rates through creative design and technical execution.",
  "freelancer-7-tit": "Digital Marketing Agency Portfolio Website Development",
  "freelancer-7-content": "Implementing WordPress to realize intuitive back-office management interfaces, granting clients without programming knowledge the ability to self-manage and edit portfolios, strengthening clients' autonomous management and content update convenience.",
  "fla-1-tit": "Cross-Department Collaboration",
  "fla-1-content": "Actively communicating and coordinating with planning and design teams to ensure consistency between design and technology, improving project efficiency and quality.",
  "fla-2-tit": "Backend Collaboration and API Integration",
  "fla-2-content": "Working closely with backend development teams to achieve API integration, ensuring accurate data transmission and dynamic functionality application.",
  "fla-3-tit": "Media Tracking and Analysis",
  "fla-3-content": "Embedding media tracking codes according to market demand, supporting data analysis and user behavior tracking, assisting in the formulation of precise marketing strategies.",
  "fla-4-tit": "Social Media Platform Integration",
  "fla-4-content": "Achieving social media platform API integration, strengthening the interaction link between the website and social media, expanding brand influence and user engagement."
}
